#include <stdio.h> /*標頭檔*/

int main() /*主函式*/
{
    int a,b,c; /*宣告a,b,c為整數變數*/
    a=125; /*令a為125*/
    b=108; /*令b為108*/
    c=115; /*令c為115*/
    int q; /*宣告q為整數變數*/
    char s; /*宣告s為字串變數*/

    printf("歡迎光臨 Subway!\n");  /*印出"歡迎光臨 Subway!" 並換行*/
    printf("A號潛艇堡是安格斯牛 價格為125元\n"); /*印出"A號潛艇堡是安格斯牛 價格為125元" 並換行*/
    printf("B號潛艇堡是香烤雞肉 價格為108元\n"); /*印出"B號潛艇堡是香烤雞肉 價格為108元" 並換行*/
    printf("C號潛艇堡是活力鮮蝦 價格為115元\n\n"); /*印出"C號潛艇堡是活力鮮蝦 價格為115元" 並換兩行*/

    printf("請選擇想吃的潛艇堡編號:"); /*印出"請選擇最想吃的潛艇堡編號:*/
    scanf("%c",&s); /*提取輸入的數值 並令其為s*/


    if(s == 'A') /*若s為A*/
    {
        printf("您選擇了A號潛艇堡安格斯牛 價格為125元\n"); /*印出"您選擇了A號潛艇堡安格斯牛 價格為125元" 並換行*/
        printf("請輸入數量:"); /*印出"請輸入數量:"*/
        scanf("%d",&q); /*提取輸入的數值 並令其為q值*/
        printf("應付金額為:%d",q*a); /*印出"應付金額為:(a*q)"*/
    }

    else if(s == 'B') /*若s為B*/
    {
        printf("您選擇了B號潛艇堡香烤雞肉 價格為108元\n"); /*印出"您選擇了B號潛艇堡香烤雞肉 價格為108元" 並換行*/
        printf("請輸入數量:"); /*印出"請輸入數量:"*/
        scanf("%d",&q); /*提取輸入的數值 並令其為q值*/
        printf("應付金額為:%d",q*b); /*印出"應付金額為:(b*q)"*/
    }

    else if(s == 'C') /*若s為C*/
    {
        printf("您選擇了C號潛艇堡是活力鮮蝦 價格為115元\n"); /*印出"您選擇了C號潛艇堡是活力鮮蝦 價格為115元" 並換行*/
        printf("請輸入數量:"); /*印出"請輸入數量:"*/
        scanf("%d",&q); /*提取輸入的數值 並令其為q值*/
        printf("應付金額為:%d",q*c); /*印出"應付金額為:(c*q)"*/
    }

    else /*敘述為假*/
    printf("輸入錯誤 無此套餐\"); /*印出輸入錯誤 無此套餐*/


    return 0;/*回傳值0*/
}
