#include<stdio.h> /*標頭檔*/

int main() /*主函式*/
{
    int hw,q1,q2,report;   /*宣告變數 hw,q1,q2,report */
    printf("請輸入作業成績(25%%):");               /*印出"請輸入作業成績(25%%):"*/
    scanf("%d",&hw);                               /*提取輸入的變數 並令其為hw值*/
    printf("請輸入計概期中考成績(25%%):");         /*印出"請輸入計概期中考成績(25%%):"*/
    scanf("%d",&q1);                               /*提取輸入的變數 並令其為q1值*/
    printf("請輸入計概期末考成績(25%%):");         /*印出"請輸入計概期末考成績(25%%):"*/
    scanf("%d",&q2);                               /*提取輸入的變數 並令其為q2值*/
    printf("請輸入上台報告成績(25%%):");           /*印出"請輸入上台報告成績(25%%):"*/
    scanf("%d",&report);                           /*提取輸入的變數 並令其為report值*/

    printf("總成績為%d\n",(hw+q1+q2+report)/4 );   /*印出"總成績為:(所有變數平均值)"*/


    if((hw+q1+q2+report)/4>=59.5) /*若總成績大於等於59.5*/
    {
        printf("及格，恭喜過關"); /*及格，恭喜過關*/
    }

    if((hw+q1+q2+report)/4<59.5)  /*若總成績小於59.5*/
    {
        printf("沒關係，再接再厲!"); /*印出"沒關係，再接再厲!"*/
    }


    return 0; /*回傳值0*/
}
